Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: وأنه هو رب الشعرى
en: And that He it is Who is the Lord of Sirius;

source: وأنه أهلك عادا الأولى
en: And that He destroyed the former (tribe of) A'ad,

source: وثمود فما أبقى
en: And (the tribe of) Thamud He spared not;

source: وقوم نوح من قبل إنهم كانوا هم أظلم وأطغى
en: And the folk of Noah aforetime, Lo! they were more unjust and more rebellious;

source: والمؤتفكة أهوى
en: And Al-Mu'tafikah He destroyed

source: فغشاها ما غشى
en: So that there covered them that which did cover.

source: فبأي آلاء ربك تتمارى
en: Concerning which then, of the bounties of thy Lord, canst thou dispute?

source: هذا نذير من النذر الأولى
en: This is a warner of the warners of old.

source: أزفت الآزفة
en: The threatened Hour is nigh.

source: ليس لها من دون الله كاشفة
en: None beside Allah can disclose it.

source: أفمن هذا الحديث تعجبون
en: Marvel ye then at this statement,

source: وتضحكون ولا تبكون
en: And laugh and not weep,

source: وأنتم سامدون
en: While ye amuse yourselves?

source: فاسجدوا لله واعبدوا
en: Rather prostrate yourselves before Allah and serve Him.

source: اقتربت الساعة وانشق القمر
en: The hour drew nigh and the moon was rent in twain.

source: وإن يروا آية يعرضوا ويقولوا سحر مستمر
en: And if they behold a portent they turn away and say: Prolonged illusion.

source: وكذبوا واتبعوا أهواءهم وكل أمر مستقر
en: They denied (the Truth) and followed their own lusts. Yet everything will come to a decision

source: ولقد جاءهم من الأنباء ما فيه مزدجر
en: And surely there hath come unto them news whereof the purport should deter,

source: حكمة بالغة فما تغن النذر
en: Effective wisdom; but warnings avail not.

source: فتول عنهم يوم يدع الداع إلى شيء نكر
en: So withdraw from them (O Muhammad) on the day when the Summoner summoneth unto a painful thing.

source: خشعا أبصارهم يخرجون من الأجداث كأنهم جراد منتشر
en: With downcast eyes, they come forth from the graves as they were locusts spread abroad,

source: مهطعين إلى الداع يقول الكافرون هذا يوم عسر
en: Hastening toward the summoner; the disbelievers say: This is a hard day.

source: كذبت قبلهم قوم نوح فكذبوا عبدنا وقالوا مجنون وازدجر
en: The folk of Noah denied before them, yea, they denied Our slave and said: A madman; and he was repulsed.

source: فدعا ربه أني مغلوب فانتصر
en: So he cried unto his Lord, saying: I am vanquished, so give help.

source: ففتحنا أبواب السماء بماء منهمر
en: Then opened We the gates of heaven with pouring water

source: وفجرنا الأرض عيونا فالتقى الماء على أمر قد قدر
en: And caused the earth to gush forth springs, so that the waters met for a predestined purpose.

source: وحملناه على ذات ألواح ودسر
en: And We carried him upon a thing of planks and nails,

source: تجري بأعيننا جزاء لمن كان كفر
en: That ran (upon the waters) in Our sight, as a reward for him who was rejected.

source: ولقد تركناها آية فهل من مدكر
en: And verily We left it as a token; but is there any that remembereth?

source: فكيف كان عذابي ونذر
en: Then see how (dreadful) was My punishment after My warnings!

source: ولقد يسرنا القرآن للذكر فهل من مدكر
en: And in truth We have made the Qur'an easy to remember; but is there any that remembereth?

source: كذبت عاد فكيف كان عذابي ونذر
en: (The tribe of) A'ad rejected warnings. Then how (dreadful) was My punishment after My warnings.

source: إنا أرسلنا عليهم ريحا صرصرا في يوم نحس مستمر
en: Lo! We let loose on them a raging wind on a day of constant calamity,

source: تنزع الناس كأنهم أعجاز نخل منقعر
en: Sweeping men away as though they were uprooted trunks of palm-trees.

source: كذبت ثمود بالنذر
en: (The tribe of) Thamud rejected warnings

source: فقالوا أبشرا منا واحدا نتبعه إنا إذا لفي ضلال وسعر
en: For they said; Is it a mortal man, alone among us, that we are to follow? Then indeed we should fall into error and madness.

source: أألقي الذكر عليه من بيننا بل هو كذاب أشر
en: Hath the remembrance been given unto him alone among us? Nay, but he is a rash liar.

source: سيعلمون غدا من الكذاب الأشر
en: (Unto their warner it was said): To-morrow they will know who is the rash liar.

source: إنا مرسلو الناقة فتنة لهم فارتقبهم واصطبر
en: Lo! We are sending the she-camel as a test for them; so watch them and have patience;

source: ونبئهم أن الماء قسمة بينهم كل شرب محتضر
en: And inform them that the water is to be shared between (her and) them. Every drinking will be witnessed.

source: فنادوا صاحبهم فتعاطى فعقر
en: But they call their comrade and he took and hamstrung (her).

source: إنا أرسلنا عليهم صيحة واحدة فكانوا كهشيم المحتظر
en: Lo! We sent upon them one Shout, and they became as the dry twigs (rejected by) the builder of a cattle-fold.

source: كذبت قوم لوط بالنذر
en: The folk of Lot rejected warnings.

source: إنا أرسلنا عليهم حاصبا إلا آل لوط نجيناهم بسحر
en: Lo! We sent a storm of stones upon them (all) save the family of Lot, whom We rescued in the last watch of the night,

source: نعمة من عندنا كذلك نجزي من شكر
en: As grace from Us. Thus We reward him who giveth thanks.

source: ولقد أنذرهم بطشتنا فتماروا بالنذر
en: And he indeed had warned them of Our blow, but they did doubt the warnings.

source: ولقد راودوه عن ضيفه فطمسنا أعينهم فذوقوا عذابي ونذر
en: They even asked of him his guests for an ill purpose. Then We blinded their eyes (and said): Taste now My punishment after My warnings!

source: ولقد صبحهم بكرة عذاب مستقر
en: And in truth the punishment decreed befell them early in the morning.

source: فذوقوا عذابي ونذر
en: Now taste My punishment after My warnings!

source: ولقد جاء آل فرعون النذر
en: And warnings came in truth unto the house of Pharaoh

source: كذبوا بآياتنا كلها فأخذناهم أخذ عزيز مقتدر
en: Who denied Our revelations, every one. Therefore We grasped them with the grasp of the Mighty, the Powerful.

source: أكفاركم خير من أولئكم أم لكم براءة في الزبر
en: Are your disbelievers better than those, or have ye some immunity in the scriptures?

source: أم يقولون نحن جميع منتصر
en: Or say they: We are a host victorious?

source: سيهزم الجمع ويولون الدبر
en: The hosts will all be routed and will turn and flee.

source: بل الساعة موعدهم والساعة أدهى وأمر
en: Nay, but the Hour (of doom) is their appointed tryst, and the Hour will be more wretched and more bitter (than their earthly failure).

source: إن المجرمين في ضلال وسعر
en: Lo! the guilty are in error and madness.

source: يوم يسحبون في النار على وجوههم ذوقوا مس سقر
en: On the day when they are dragged into the Fire upon their faces (it is said unto them): Feel the touch of hell.

source: إنا كل شيء خلقناه بقدر
en: Lo! We have created every thing by measure.

source: وما أمرنا إلا واحدة كلمح بالبصر
en: And Our commandment is but one (commandment), as the twinkling of an eye.

source: ولقد أهلكنا أشياعكم فهل من مدكر
en: And verily We have destroyed your fellows; but is there any that remembereth?

source: وكل شيء فعلوه في الزبر
en: And every thing they did is in the scriptures,

source: وكل صغير وكبير مستطر
en: And every small and great thing is recorded.

source: إن المتقين في جنات ونهر
en: Lo! the righteous will dwell among gardens and rivers,

source: في مقعد صدق عند مليك مقتدر
en: Firmly established in the favour of a Mighty King.

source: الرحمن
en: The Beneficent

source: علم القرآن
en: Hath made known the Qur'an.

source: خلق الإنسان
en: He hath created man.

source: علمه البيان
en: He hath taught him utterance.

source: الشمس والقمر بحسبان
en: The sun and the moon are made punctual.

source: والنجم والشجر يسجدان
en: The stars and the trees prostrate.

source: والسماء رفعها ووضع الميزان
en: And the sky He hath uplifted; and He hath set the measure,

source: ألا تطغوا في الميزان
en: That ye exceed not the measure,

source: وأقيموا الوزن بالقسط ولا تخسروا الميزان
en: But observe the measure strictly, nor fall short thereof.

source: والأرض وضعها للأنام
en: And the earth hath He appointed for (His) creatures,

source: فيها فاكهة والنخل ذات الأكمام
en: Wherein are fruit and sheathed palm-trees,

source: والحب ذو العصف والريحان
en: Husked grain and scented herb.

source: فبأي آلاء ربكما تكذبان
en: Which is it, of the favours of your Lord, that ye deny?

source: خلق الإنسان من صلصال كالفخار
en: He created man of clay like the potter's,

source: وخلق الجان من مارج من نار
en: And the jinn did He create of smokeless fire.

source: رب المشرقين ورب المغربين
en: Lord of the two Easts, and Lord of the two Wests!

source: مرج البحرين يلتقيان
en: He hath loosed the two seas. They meet.

source: بينهما برزخ لا يبغيان
en: There is a barrier between them. They encroach not (one upon the other).

source: يخرج منهما اللؤلؤ والمرجان
en: There cometh forth from both of them the pearl and coral-stone.

source: وله الجوار المنشآت في البحر كالأعلام
en: His are the ships displayed upon the sea, like banners.

source: كل من عليها فان
en: Everyone that is thereon will pass away;

source: ويبقى وجه ربك ذو الجلال والإكرام
en: There remaineth but the Countenance of thy Lord of Might and Glory.

source: يسأله من في السماوات والأرض كل يوم هو في شأن
en: All that are in the heavens and the earth entreat Him. Every day He exerciseth (universal) power.

source: سنفرغ لكم أيه الثقلان
en: We shall dispose of you, O ye two dependents (man and jinn).

source: يا معشر الجن والإنس إن استطعتم أن تنفذوا من أقطار السماوات والأرض فانفذوا لا تنفذون إلا بسلطان
en: O company of jinn and men, if ye have power to penetrate (all) regions of the heavens and the earth, then penetrate (them)! Ye will never penetrate them save with (Our) sanction.

source: يرسل عليكما شواظ من نار ونحاس فلا تنتصران
en: There will be sent, against you both, heat of fire and flash of brass, and ye will not escape.

source: فإذا انشقت السماء فكانت وردة كالدهان
en: And when the heaven splitteth asunder and becometh rosy like red hide -

source: فيومئذ لا يسأل عن ذنبه إنس ولا جان
en: On that day neither man nor jinni will be questioned of his sin.

source: يعرف المجرمون بسيماهم فيؤخذ بالنواصي والأقدام
en: The guilty will be known by their marks, and will be taken by the forelocks and the feet.

source: هذه جهنم التي يكذب بها المجرمون
en: This is hell which the guilty deny.

source: يطوفون بينها وبين حميم آن
en: They go circling round between it and fierce, boiling water.

source: ولمن خاف مقام ربه جنتان
en: But for him who feareth the standing before his Lord there are two gardens.

source: ذواتا أفنان
en: Of spreading branches.

source: فيهما عينان تجريان
en: Wherein are two fountains flowing.

source: فيهما من كل فاكهة زوجان
en: Wherein is every kind of fruit in pairs.

source: متكئين على فرش بطائنها من إستبرق وجنى الجنتين دان
en: Reclining upon couches lined with silk brocade, the fruit of both the gardens near to hand.

source: فيهن قاصرات الطرف لم يطمثهن إنس قبلهم ولا جان
en: Therein are those of modest gaze, whom neither man nor jinni will have touched before them.

source: كأنهن الياقوت والمرجان
en: (In beauty) like the jacynth and the coral-stone.

source: هل جزاء الإحسان إلا الإحسان
en: Is the reward of goodness aught save goodness?

source: ومن دونهما جنتان
en: And beside them are two other gardens,

source: مدهامتان
en: Dark green with foliage.

source: فيهما عينان نضاختان
en: Wherein are two abundant springs.

source: فيهما فاكهة ونخل ورمان
en: Wherein is fruit, the date-palm and pomegranate.

source: فيهن خيرات حسان
en: Wherein (are found) the good and beautiful -

source: حور مقصورات في الخيام
en: Fair ones, close-guarded in pavilions -

source: لم يطمثهن إنس قبلهم ولا جان
en: Whom neither man nor jinni will have touched before them -

source: متكئين على رفرف خضر وعبقري حسان
en: Reclining on green cushions and fair carpets.

source: تبارك اسم ربك ذي الجلال والإكرام
en: Blessed be the name of thy Lord, Mighty and glorious!

source: إذا وقعت الواقعة
en: When the event befalleth -

source: ليس لوقعتها كاذبة
en: There is no denying that it will befall -

source: خافضة رافعة
en: Abasing (some), exalting (others);

source: إذا رجت الأرض رجا
en: When the earth is shaken with a shock

source: وبست الجبال بسا
en: And the hills are ground to powder

source: فكانت هباء منبثا
en: So that they become a scattered dust,

source: وكنتم أزواجا ثلاثة
en: And ye will be three kinds:

source: فأصحاب الميمنة ما أصحاب الميمنة
en: (First) those on the right hand; what of those on the right hand?

source: وأصحاب المشأمة ما أصحاب المشأمة
en: And (then) those on the left hand; what of those on the left hand?

source: والسابقون السابقون
en: And the foremost in the race, the foremost in the race:

source: أولئك المقربون
en: Those are they who will be brought nigh

source: ثلة من الأولين
en: A multitude of those of old

source: وقليل من الآخرين
en: And a few of those of later time.

source: على سرر موضونة
en: On lined couches,

source: متكئين عليها متقابلين
en: Reclining therein face to face.

source: يطوف عليهم ولدان مخلدون
en: There wait on them immortal youths

source: بأكواب وأباريق وكأس من معين
en: With bowls and ewers and a cup from a pure spring

source: لا يصدعون عنها ولا ينزفون
en: Wherefrom they get no aching of the head nor any madness,

source: وفاكهة مما يتخيرون
en: And fruit that they prefer

source: ولحم طير مما يشتهون
en: And flesh of fowls that they desire.

source: وحور عين
en: And (there are) fair ones with wide, lovely eyes,

source: كأمثال اللؤلؤ المكنون
en: Like unto hidden pearls,

source: جزاء بما كانوا يعملون
en: Reward for what they used to do.

source: لا يسمعون فيها لغوا ولا تأثيما
en: There hear they no vain speaking nor recrimination

source: إلا قيلا سلاما سلاما
en: (Naught) but the saying: Peace, (and again) Peace.

source: وأصحاب اليمين ما أصحاب اليمين
en: And those on the right hand; what of those on the right hand?

source: في سدر مخضود
en: Among thornless lote-trees

source: وطلح منضود
en: And clustered plantains,

source: وظل ممدود
en: And spreading shade,

source: وماء مسكوب
en: And water gushing,

source: وفاكهة كثيرة
en: And fruit in plenty

source: لا مقطوعة ولا ممنوعة
en: Neither out of reach nor yet forbidden,

source: وفرش مرفوعة
en: And raised couches;

source: إنا أنشأناهن إنشاء
en: Lo! We have created them a (new) creation

source: فجعلناهن أبكارا
en: And made them virgins,

source: عربا أترابا
en: Lovers, friends,

source: لأصحاب اليمين
en: For those on the right hand;

source: وثلة من الآخرين
en: And a multitude of those of later time.

source: وأصحاب الشمال ما أصحاب الشمال
en: And those on the left hand: What of those on the left hand?

source: في سموم وحميم
en: In scorching wind and scalding water

source: وظل من يحموم
en: And shadow of black smoke,

source: لا بارد ولا كريم
en: Neither cool nor refreshing.

source: إنهم كانوا قبل ذلك مترفين
en: Lo! heretofore they were effete with luxury

source: وكانوا يصرون على الحنث العظيم
en: And used to persist in the awful sin.

source: وكانوا يقولون أئذا متنا وكنا ترابا وعظاما أإنا لمبعوثون
en: And they used to say: When we are dead and have become dust and bones, shall we then, forsooth, be raised again,

source: قل إن الأولين والآخرين
en: Say (unto them, O Muhammad): Lo! those of old and those of later time

source: لمجموعون إلى ميقات يوم معلوم
en: Will all be brought together to the tryst of an appointed day.

source: ثم إنكم أيها الضالون المكذبون
en: Then lo! ye, the erring, the deniers,

source: لآكلون من شجر من زقوم
en: Ye verily will eat of a tree called Zaqqum

source: فمالئون منها البطون
en: And will fill your bellies therewith;

source: فشاربون عليه من الحميم
en: And thereon ye will drink of boiling water,

source: فشاربون شرب الهيم
en: Drinking even as the camel drinketh.

source: هذا نزلهم يوم الدين
en: This will be their welcome on the Day of Judgment.

source: نحن خلقناكم فلولا تصدقون
en: We created you. Will ye then admit the truth?

source: أفرأيتم ما تمنون
en: Have ye seen that which ye emit?

source: أأنتم تخلقونه أم نحن الخالقون
en: Do ye create it or are We the Creator?

source: نحن قدرنا بينكم الموت وما نحن بمسبوقين
en: We mete out death among you, and We are not to be outrun,

source: على أن نبدل أمثالكم وننشئكم في ما لا تعلمون
en: That We may transfigure you and make you what ye know not.

source: ولقد علمتم النشأة الأولى فلولا تذكرون
en: And verily ye know the first creation. Why, then, do ye not reflect?

source: أفرأيتم ما تحرثون
en: Have ye seen that which ye cultivate?

source: أأنتم تزرعونه أم نحن الزارعون
en: Is it ye who foster it, or are We the Fosterer?

source: لو نشاء لجعلناه حطاما فظلتم تفكهون
en: If We willed, We verily could make it chaff, then would ye cease not to exclaim:

source: إنا لمغرمون
en: Lo! we are laden with debt!

source: بل نحن محرومون
en: Nay, but we are deprived!

source: أفرأيتم الماء الذي تشربون
en: Have ye observed the water which ye drink?

source: أأنتم أنزلتموه من المزن أم نحن المنزلون
en: Is it ye who shed it from the raincloud, or are We the Shedder?

source: لو نشاء جعلناه أجاجا فلولا تشكرون
en: If We willed We verily could make it bitter. Why then, give ye not thanks?

source: أفرأيتم النار التي تورون
en: Have ye observed the fire which ye strike out;

source: أأنتم أنشأتم شجرتها أم نحن المنشئون
en: Was it ye who made the tree thereof to grow, or were We the grower?

source: نحن جعلناها تذكرة ومتاعا للمقوين
en: We, even We, appointed it a memorial and a comfort for the dwellers in the wilderness.

source: فسبح باسم ربك العظيم
en: Therefor (O Muhammad), praise the name of thy Lord, the Tremendous.

source: فلا أقسم بمواقع النجوم
en: Nay, I swear by the places of the stars -

source: وإنه لقسم لو تعلمون عظيم
en: And lo! that verily is a tremendous oath, if ye but knew -

source: إنه لقرآن كريم
en: That (this) is indeed a noble Qur'an

source: في كتاب مكنون
en: In a Book kept hidden

source: لا يمسه إلا المطهرون
en: Which none toucheth save the purified,

source: تنزيل من رب العالمين
en: A revelation from the Lord of the Worlds.

source: أفبهذا الحديث أنتم مدهنون
en: Is it this Statement that ye scorn,

source: وتجعلون رزقكم أنكم تكذبون
en: And make denial thereof your livelihood?

source: فلولا إذا بلغت الحلقوم
en: Why, then, when (the soul) cometh up to the throat (of the dying)

source: وأنتم حينئذ تنظرون
en: And ye are at that moment looking

source: ونحن أقرب إليه منكم ولكن لا تبصرون
en: - And We are nearer unto him than ye are, but ye see not -

source: فلولا إن كنتم غير مدينين
en: Why then, if ye are not in bondage (unto Us),

source: ترجعونها إن كنتم صادقين
en: Do ye not force it back, if ye are truthful?

source: فأما إن كان من المقربين
en: Thus if he is of those brought nigh,

source: فروح وريحان وجنت نعيم
en: Then breath of life, and plenty, and a Garden of delight.

source: وأما إن كان من أصحاب اليمين
en: And if he is of those on the right hand,

source: فسلام لك من أصحاب اليمين
en: Then (the greeting) "Peace be unto thee" from those on the right hand.

source: وأما إن كان من المكذبين الضالين
en: But if he is of the rejecters, the erring,

source: فنزل من حميم
en: Then the welcome will be boiling water

source: وتصلية جحيم
en: And roasting at hell-fire.

source: إن هذا لهو حق اليقين
en: Lo! this is certain truth.

source: سبح لله ما في السماوات والأرض وهو العزيز الحكيم
en: All that is in the heavens and the earth glorifieth Allah; and He is the Mighty, the Wise.

source: له ملك السماوات والأرض يحيي ويميت وهو على كل شيء قدير
en: His is the Sovereignty of the heavens and the earth; He quickeneth and He giveth death; and He is Able to do all things.

source: هو الأول والآخر والظاهر والباطن وهو بكل شيء عليم
en: He is the First and the Last, and the Outward and the Inward; and He is Knower of all things.

source: هو الذي خلق السماوات والأرض في ستة أيام ثم استوى على العرش يعلم ما يلج في الأرض وما يخرج منها وما ينزل من السماء وما يعرج فيها وهو معكم أين ما كنتم والله بما تعملون بصير
en: He it is Who created the heavens and the earth in six Days; then He mounted the Throne. He knoweth all that entereth the earth and all that emergeth therefrom and all that cometh down from the sky and all that ascendeth therein; and He is with you wheresoever ye may be. And Allah is Seer of what ye do.

source: له ملك السماوات والأرض وإلى الله ترجع الأمور
en: His is the Sovereignty of the heavens and the earth, and unto Allah (all) things are brought back.

source: يولج الليل في النهار ويولج النهار في الليل وهو عليم بذات الصدور
en: He causeth the night to pass into the day, and He causeth the day to pass into the night, and He is knower of all that is in the breasts.

source: آمنوا بالله ورسوله وأنفقوا مما جعلكم مستخلفين فيه فالذين آمنوا منكم وأنفقوا لهم أجر كبير
en: Believe in Allah and His messenger, and spend of that whereof He hath made you trustees; and such of you as believe and spend (aright), theirs will be a great reward.

source: وما لكم لا تؤمنون بالله والرسول يدعوكم لتؤمنوا بربكم وقد أخذ ميثاقكم إن كنتم مؤمنين
en: What aileth you that ye believe not in Allah, when the messenger calleth you to believe in your Lord, and He hath already made a covenant with you, if ye are believers?

source: هو الذي ينزل على عبده آيات بينات ليخرجكم من الظلمات إلى النور وإن الله بكم لرءوف رحيم
en: He it is Who sendeth down clear revelations unto His slave, that He may bring you forth from darkness unto light; and lo! for you, Allah is Full of Pity, Merciful.

source: وما لكم ألا تنفقوا في سبيل الله ولله ميراث السماوات والأرض لا يستوي منكم من أنفق من قبل الفتح وقاتل أولئك أعظم درجة من الذين أنفقوا من بعد وقاتلوا وكلا وعد الله الحسنى والله بما تعملون خبير
en: And what aileth you that ye spend not in the way of Allah when unto Allah belongeth the inheritance of the heavens and the earth? Those who spent and fought before the victory are not upon a level (with the rest of you). Such are greater in rank than those who spent and fought afterwards. Unto each hath Allah promised good. And Allah is Informed of what ye do.

source: من ذا الذي يقرض الله قرضا حسنا فيضاعفه له وله أجر كريم
en: Who is he that will lend unto Allah a goodly loan, that He may double it for him and his may be a rich reward?

source: يوم ترى المؤمنين والمؤمنات يسعى نورهم بين أيديهم وبأيمانهم بشراكم اليوم جنات تجري من تحتها الأنهار خالدين فيها ذلك هو الفوز العظيم
en: On the day when thou (Muhammad) wilt see the believers, men and women, their light shining forth before them and on their right hands, (and wilt hear it said unto them): Glad news for you this day: Gardens underneath which rivers flow, wherein ye are immortal. That is the supreme triumph.

source: يوم يقول المنافقون والمنافقات للذين آمنوا انظرونا نقتبس من نوركم قيل ارجعوا وراءكم فالتمسوا نورا فضرب بينهم بسور له باب باطنه فيه الرحمة وظاهره من قبله العذاب
en: On the day when the hypocritical men and the hypocritical women will say unto those who believe: Look on us that we may borrow from your light! it will be said: Go back and seek for light! Then there will separate them a wall wherein is a gate, the inner side whereof containeth mercy, while the outer side thereof is toward the doom.

source: ينادونهم ألم نكن معكم قالوا بلى ولكنكم فتنتم أنفسكم وتربصتم وارتبتم وغرتكم الأماني حتى جاء أمر الله وغركم بالله الغرور
en: They will cry unto them (saying): Were we not with you? They will say: Yea, verily; but ye tempted one another, and hesitated, and doubted, and vain desires beguiled you till the ordinance of Allah came to pass; and the deceiver deceived you concerning Allah;

source: فاليوم لا يؤخذ منكم فدية ولا من الذين كفروا مأواكم النار هي مولاكم وبئس المصير
en: So this day no ransom can be taken from you nor from those who disbelieved. Your home is the Fire; that is your patron, and a hapless journey's end.

source: ألم يأن للذين آمنوا أن تخشع قلوبهم لذكر الله وما نزل من الحق ولا يكونوا كالذين أوتوا الكتاب من قبل فطال عليهم الأمد فقست قلوبهم وكثير منهم فاسقون
en: Is not the time ripe for the hearts of those who believe to submit to Allah's reminder and to the truth which is revealed, that they become not as those who received the scripture of old but the term was prolonged for them and so their hearts were hardened, and many of them are evil-livers.
